## all missions to practice
### mission 1

In [162]:
import numpy as np 
import pandas as pd 
import matplotlib.pyplot as plt

In [163]:
f500 = pd.read_csv("f500.csv")
f500.head()

,company,rank,revenues,revenue_change,profits,assets,profit_change,ceo,industry,sector,previous_rank,country,hq_location,website,years_on_global_500_list,employees,total_stockholder_equity
0,Walmart,1,485873,0.8,13643.0,198825,-7.2,C. Douglas McMillon,General Merchandisers,Retailing,1,USA,"Bentonville, AR",http://www.walmart.com,23,2300000,77798
1,State Grid,2,315199,-4.4,9571.3,489838,-6.2,Kou Wei,Utilities,Energy,2,China,"Beijing, China",http://www.sgcc.com.cn,17,926067,209456
2,Sinopec Group,3,267518,-9.1,1257.9,310726,-65.0,Wang Yupu,Petroleum Refining,Energy,4,China,"Beijing, China",http://www.sinopec.com,19,713288,106523
3,China National Petroleum,4,262573,-12.3,1867.5,585619,-73.7,Zhang Jianhua,Petroleum Refining,Energy,3,China,"Beijing, China",http://www.cnpc.com.cn,17,1512048,301893
4,Toyota Motor,5,254694,7.7,16899.3,437575,-12.3,Akio Toyoda,Motor Vehicles and Parts,Motor Vehicles & Parts,8,Japan,"Toyota, Japan",http://www.toyota-global.com,23,364445,157210

In [164]:
f500.describe()

,rank,revenues,revenue_change,profits,assets,profit_change,previous_rank,years_on_global_500_list,employees,total_stockholder_equity
count,500.000000,500.000000,498.000000,499.000000,5.000000e+02,436.000000,500.000000,500.000000,5.000000e+02,500.000000
mean,250.500000,55416.358000,4.538353,3055.203206,2.436323e+05,24.152752,222.134000,15.036000,1.339983e+05,30628.076000
std,144.481833,45725.478963,28.549067,5171.981071,4.851937e+05,437.509566,146.941961,7.932752,1.700878e+05,43642.576833
min,1.000000,21609.000000,-67.300000,-13038.000000,3.717000e+03,-793.700000,0.000000,1.000000,3.280000e+02,-59909.000000
25%,125.750000,29003.000000,-5.900000,556.950000,3.658850e+04,-22.775000,92.750000,7.000000,4.293250e+04,7553.750000
50%,250.500000,40236.000000,0.550000,1761.600000,7.326150e+04,-0.350000,219.500000,17.000000,9.291050e+04,15809.500000
75%,375.250000,63926.750000,6.975000,3954.000000,1.805640e+05,17.700000,347.250000,23.000000,1.689172e+05,37828.500000
max,500.000000,485873.000000,442.300000,45687.000000,3.473238e+06,8909.500000,500.000000,23.000000,2.300000e+06,301893.000000

In [165]:
ceo = f500.iloc[:, 7]
ceo.head()

0    C. Douglas McMillon
1                Kou Wei
2              Wang Yupu
3          Zhang Jianhua
4            Akio Toyoda
Name: ceo, dtype: object

In [166]:
ceo.iloc[4]

'Akio Toyoda'

In [167]:
company = f500.iloc[:, 0]

company.head(7)

0                     Walmart
1                  State Grid
2               Sinopec Group
3    China National Petroleum
4                Toyota Motor
5                  Volkswagen
6           Royal Dutch Shell
Name: company, dtype: object

In [168]:
f500.iloc[[1,15]]

,company,rank,revenues,revenue_change,profits,assets,profit_change,ceo,industry,sector,previous_rank,country,hq_location,website,years_on_global_500_list,employees,total_stockholder_equity
1,State Grid,2,315199,-4.4,9571.3,489838,-6.2,Kou Wei,Utilities,Energy,2,China,"Beijing, China",http://www.sgcc.com.cn,17,926067,209456
15,Glencore,16,173883,2.0,1379.0,124600,NaN,Ivan Glasenberg,"Mining, Crude-Oil Production",Energy,14,Switzerland,"Baar, Switzerland",http://www.glencore.com,7,93123,44243

In [169]:
f500.profit_change.isnull().value_counts()

False    436
True      64
Name: profit_change, dtype: int64

- we have 64 companies with no change in the profit

In [170]:
# companies which it have no profit change
comp = f500.loc[f500.profit_change.isnull() , ["company" , "country"]]
comp

                                          company      country
5                                      Volkswagen      Germany
7                              Berkshire Hathaway          USA
11                                             BP      Britain
15                                       Glencore  Switzerland
22                              AmerisourceBergen          USA
..                                            ...          ...
472                                        Altice  Netherlands
473                                          Onex       Canada
475  Shanxi Jincheng Anthracite Coal Mining Group        China
488                                Sears Holdings          USA
492                                Telecom Italia        Italy

[64 rows x 2 columns]

In [171]:
# the rest of the companies with change in the profit

comp_2 = f500.loc[f500.profit_change.notnull() , ["country" , "company"]]
comp_2

     country                         company
0        USA                         Walmart
1      China                      State Grid
2      China                   Sinopec Group
3      China        China National Petroleum
4      Japan                    Toyota Motor
..       ...                             ...
495   Israel  Teva Pharmaceutical Industries
496    China        New China Life Insurance
497  Britain       Wm. Morrison Supermarkets
498  Germany                             TUI
499      USA                      AutoNation

[436 rows x 2 columns]

In [172]:
f500_2 = f500.copy()

In [173]:
f500_2.loc[f500.previous_rank== 0 , "previous_rank"]  = np.nan

In [174]:
f500.loc[f500.previous_rank == 0 , "previous_rank"] = np.nan

In [175]:
f500.loc[f500.previous_rank.isnull() , "previous_rank"]

48    NaN
90    NaN
123   NaN
138   NaN
140   NaN
180   NaN
267   NaN
271   NaN
341   NaN
375   NaN
376   NaN
392   NaN
409   NaN
414   NaN
431   NaN
440   NaN
441   NaN
446   NaN
456   NaN
458   NaN
461   NaN
463   NaN
466   NaN
472   NaN
477   NaN
482   NaN
484   NaN
487   NaN
491   NaN
493   NaN
494   NaN
495   NaN
499   NaN
Name: previous_rank, dtype: float64

In [176]:
prev_rank = f500[f500.previous_rank.notnull()]
rank_change = prev_rank["previous_rank"] - prev_rank["rank"]

rank_change.shape

(467,)

In [177]:
# assign the rank_change as new column to the data

f500["rank_change"] = rank_change

In [178]:
f500["rank_change"].value_counts(dropna = False)

 NaN      33
-1.0      14
-4.0      13
-2.0      12
 8.0      12
          ..
-105.0     1
-44.0      1
 62.0      1
 158.0     1
-61.0      1
Name: rank_change, Length: 153, dtype: int64

**using logical operators with pandas for combining conditions**

- the question is what are the chinese companies with revenue greater than 265 billion dollars ?

In [179]:
chinese = f500["country"] == "China"
rev_265 = f500["revenues"] > 265000

f500.loc[chinese & rev_265 , ["company" , "country" , "rank"]]

         company country  rank
1     State Grid   China     2
2  Sinopec Group   China     3

In [180]:
# the american or chinese companies with revenues more than 200 billion dollars
condition = ((f500["country"] == "USA") | (f500["country"] == "China")) & (f500["revenues"] > 200000)

american_chinese_comp = f500.loc[condition , ["company" , "country" , "rank"]]

american_chinese_comp

                    company country  rank
0                   Walmart     USA     1
1                State Grid   China     2
2             Sinopec Group   China     3
3  China National Petroleum   China     4
7        Berkshire Hathaway     USA     8
8                     Apple     USA     9
9               Exxon Mobil     USA    10

-  *we have 7 companies 3 chinese and 4 in USA have revenues more than 200 billions annually*

- another question is how many company from germany or france in the dataset ?

In [181]:
ger_fra = (f500["country"] == "Germany" )| (f500["country"] == "France")

ger_fra_companies = f500.loc[ger_fra , ["company" , "country" , "rank" , "revenues"]]

In [182]:
# loop inside a column 
s = 0
for country in f500["country"]:
    if country == "China":
        s+= 1
s

109

- can u list the tech companies in the dataset ?

In [183]:
f500.loc[f500["sector"] == "Technology" , ["company" , "country"]]

                                company      country
8                                 Apple          USA
14                  Samsung Electronics  South Korea
25                           Amazon.com          USA
26           Hon Hai Precision Industry       Taiwan
64                             Alphabet          USA
68                            Microsoft          USA
70                              Hitachi        Japan
80                                  IBM          USA
82          Huawei Investment & Holding        China
104                                Sony        Japan
109                           Panasonic        Japan
123                   Dell Technologies          USA
143                               Intel          USA
180          Hewlett Packard Enterprise          USA
182            Amer International Group        China
186                       Cisco Systems          USA
193                                  HP          USA
200                      LG Electronics  South Korea
225                        Lenovo Group        China
236                             Fujitsu        Japan
259             Honeywell International          USA
260                              JD.com        China
261                 Mitsubishi Electric        Japan
279                              Oracle          USA
295                            Pegatron       Taiwan
304                           Accenture      Ireland
346                               Canon        Japan
361                   China Electronics        China
368  Taiwan Semiconductor Manufacturing       Taiwan
389                     Quanta Computer       Taiwan
392                            Facebook          USA
398                  Schneider Electric       France
414                               Nokia      Finland
418                         LM Ericsson       Sweden
436                                 NEC        Japan
442                                 SAP      Germany
449                         Midea Group        China
454                                Flex    Singapore
457                  Compal Electronics       Taiwan
459                            Qualcomm          USA
461               Alibaba Group Holding        China
473                                Onex       Canada
477                    Tencent Holdings        China
478                          LG Display  South Korea

## Sorting values
- df.sort_values()

In [184]:
chinese = f500.loc[f500["country"] == "China"]

chinese_sel = chinese[["company"  , "country" , "rank" , "employees"]]
chinese_sel.sort_values(by = "employees" , ascending = False)

                                company country  rank  employees
3              China National Petroleum   China     4    1512048
118                    China Post Group   China   119     941211
1                            State Grid   China     2     926067
2                         Sinopec Group   China     3     713288
37           Agricultural Bank of China   China    38     501368
..                                  ...     ...   ...        ...
182            Amer International Group   China   183      17852
128                         Tewoo Group   China   129      17353
438  China National Aviation Fuel Group   China   439      11739
458             Yango Financial Holding   China   459      10234
204                         Noble Group   China   205       1000

[109 rows x 4 columns]

In [185]:
# japanese company with most employee 
japanese_comp = f500.loc[f500["country"] == "Japan" , ["company" , "rank" , "employees"]]

# sort the values by employee to know which company employ more people

japanese_comp.sort_values(by = "employees" , ascending = False)

                             company  rank  employees
4                       Toyota Motor     5     364445
70                           Hitachi    71     303887
49      Nippon Telegraph & Telephone    50     274844
86                              AEON    87     274760
109                        Panasonic   110     257533
32               Japan Post Holdings    33     248384
419     Sumitomo Electric Industries   420     248330
28                       Honda Motor    29     211915
346                            Canon   347     197673
236                          Fujitsu   237     155069
235                            Denso   236     154493
352                      Bridgestone   353     143616
261              Mitsubishi Electric   262     138700
43                      Nissan Motor    44     137250
104                             Sony   105     128400
163   Mitsubishi UFJ Financial Group   164     115276
214                           Itochu   215     110207
436                              NEC   437     107729
227    Nippon Steel & Sumitomo Metal   228     100169
323                      Aisin Seiki   324      99389
407               East Japan Railway   408      85834
110            Nippon Life Insurance   111      85171
293      Mitsubishi Heavy Industries   294      82728
201  Sumitomo Mitsui Financial Group   202      77205
144                       Mitsubishi   145      77164
281                         Sumitomo   282      70900
348     Mitsubishi Chemical Holdings   349      69291
71                    SoftBank Group    72      68402
372                     Suzuki Motor   373      62992
141           Dai-ichi Life Holdings   142      62606
329             Daiwa House Industry   330      60539
355                     JFE Holdings   356      60439
356           Mizuho Financial Group   357      59179
166               Seven & I Holdings   167      54712
366                      Mazda Motor   367      48849
339                   Sompo Holdings   340      47430
248                           Mitsui   249      42316
241          Sumitomo Life Insurance   242      42245
184             Tokyo Electric Power   185      42060
296      Meiji Yasuda Life Insurance   297      41872
187   MS&AD Insurance Group Holdings   188      40641
115                         Marubeni   116      39952
192            Tokio Marine Holdings   193      38842
351                           Subaru   352      36668
218                             KDDI   219      35032
388            Kansai Electric Power   389      32666
450             Chubu Electric Power   451      30635
126                    JXTG Holdings   127      26247
380                 Medipal Holdings   381      15745
460                 Alfresa Holdings   461      13217
422                   Idemitsu Kosan   423       9139

In [186]:
# revenue for each country 
rev_country = f500[["country" , "revenues"]]
a = rev_country["country"].unique()
print(a , type(a))

['USA' 'China' 'Japan' 'Germany' 'Netherlands' 'Britain' 'South Korea'
 'Switzerland' 'France' 'Taiwan' 'Singapore' 'Italy' 'Russia' 'Spain'
 'Brazil' 'Mexico' 'Luxembourg' 'India' 'Malaysia' 'Thailand' 'Australia'
 'Belgium' 'Norway' 'Canada' 'Ireland' 'Indonesia' 'Denmark'
 'Saudi Arabia' 'Sweden' 'Finland' 'Venezuela' 'Turkey' 'U.A.E' 'Israel'] <class 'numpy.ndarray'>

In [187]:
# top revenue company for each country 
dic = {}
countries =  f500["country"].unique()

for c in countries:
    selected = f500[f500["country"] == c]
    sorted_data = selected.sort_values(by = "revenues" , ascending = False)
    dic[c] = sorted_data.iloc[0 , 0] # to select the first company in the descending oreder 
    
dic

{'USA': 'Walmart',
 'China': 'State Grid',
 'Japan': 'Toyota Motor',
 'Germany': 'Volkswagen',
 'Netherlands': 'Royal Dutch Shell',
 'Britain': 'BP',
 'South Korea': 'Samsung Electronics',
 'Switzerland': 'Glencore',
 'France': 'AXA',
 'Taiwan': 'Hon Hai Precision Industry',
 'Singapore': 'Trafigura Group',
 'Italy': 'Assicurazioni Generali',
 'Russia': 'Gazprom',
 'Spain': 'Banco Santander',
 'Brazil': 'Petrobras',
 'Mexico': 'Pemex',
 'Luxembourg': 'ArcelorMittal',
 'India': 'Indian Oil',
 'Malaysia': 'Petronas',
 'Thailand': 'PTT',
 'Australia': 'Wesfarmers',
 'Belgium': 'Anheuser-Busch InBev',
 'Norway': 'Statoil',
 'Canada': 'Manulife Financial',
 'Ireland': 'Johnson Controls International',
 'Indonesia': 'Pertamina',
 'Denmark': 'Maersk Group',
 'Saudi Arabia': 'SABIC',
 'Sweden': 'Volvo',
 'Finland': 'Nokia',
 'Venezuela': 'Mercantil Servicios Financieros',
 'Turkey': 'Koc Holding',
 'U.A.E': 'Emirates Group',
 'Israel': 'Teva Pharmaceutical Industries'}

In [188]:
# top employer company for each country
top_employer = {}
for c in countries:
    selected_rows = f500[f500["country"] == c]
    employer = selected_rows.sort_values(by = "employees" , ascending = False).iloc[0].loc["company"]
    top_employer[c] = employer
    
top_employer

{'USA': 'Walmart',
 'China': 'China National Petroleum',
 'Japan': 'Toyota Motor',
 'Germany': 'Volkswagen',
 'Netherlands': 'EXOR Group',
 'Britain': 'Compass Group',
 'South Korea': 'Samsung Electronics',
 'Switzerland': 'Nestle',
 'France': 'Sodexo',
 'Taiwan': 'Hon Hai Precision Industry',
 'Singapore': 'Flex',
 'Italy': 'Poste Italiane',
 'Russia': 'Gazprom',
 'Spain': 'Banco Santander',
 'Brazil': 'JBS',
 'Mexico': 'America Movil',
 'Luxembourg': 'ArcelorMittal',
 'India': 'State Bank of India',
 'Malaysia': 'Petronas',
 'Thailand': 'PTT',
 'Australia': 'Wesfarmers',
 'Belgium': 'Anheuser-Busch InBev',
 'Norway': 'Statoil',
 'Canada': 'George Weston',
 'Ireland': 'Accenture',
 'Indonesia': 'Pertamina',
 'Denmark': 'Maersk Group',
 'Saudi Arabia': 'SABIC',
 'Sweden': 'H & M Hennes & Mauritz',
 'Finland': 'Nokia',
 'Venezuela': 'Mercantil Servicios Financieros',
 'Turkey': 'Koc Holding',
 'U.A.E': 'Emirates Group',
 'Israel': 'Teva Pharmaceutical Industries'}

In [189]:
# the average revenue for each country

dic = {}

countries = f500["country"].unique()

for c in countries:
    selected = f500.loc[f500["country"] == c , ["company" , "revenues"]]
    mean = selected["revenues"].mean()
    dic[c] = mean
    
dic

{'USA': 64218.371212121216,
 'China': 55397.880733944956,
 'Japan': 53164.03921568627,
 'Germany': 63915.0,
 'Netherlands': 61708.92857142857,
 'Britain': 51588.708333333336,
 'South Korea': 49725.6,
 'Switzerland': 51353.57142857143,
 'France': 55231.793103448275,
 'Taiwan': 46364.666666666664,
 'Singapore': 54454.333333333336,
 'Italy': 51899.57142857143,
 'Russia': 65247.75,
 'Spain': 40600.666666666664,
 'Brazil': 52024.57142857143,
 'Mexico': 54987.5,
 'Luxembourg': 56791.0,
 'India': 39993.0,
 'Malaysia': 49479.0,
 'Thailand': 48719.0,
 'Australia': 33688.71428571428,
 'Belgium': 45905.0,
 'Norway': 45873.0,
 'Canada': 31848.0,
 'Ireland': 32819.5,
 'Indonesia': 36487.0,
 'Denmark': 35464.0,
 'Saudi Arabia': 35421.0,
 'Sweden': 27963.666666666668,
 'Finland': 26113.0,
 'Venezuela': 24403.0,
 'Turkey': 23456.0,
 'U.A.E': 22799.0,
 'Israel': 21903.0}

## analyse laptops dataset

In [190]:
laptops = pd.read_csv("laptops.csv" , encoding = "Latin-1" )
laptops.head()

,Manufacturer,Model Name,Category,Screen Size,Screen,CPU,RAM,Storage,GPU,Operating System,Operating System Version,Weight,Price (Euros)
0,Apple,MacBook Pro,Ultrabook,"13.3""",IPS Panel Retina Display 2560x1600,Intel Core i5 2.3GHz,8GB,128GB SSD,Intel Iris Plus Graphics 640,macOS,NaN,1.37kg,"1339,69"
1,Apple,Macbook Air,Ultrabook,"13.3""",1440x900,Intel Core i5 1.8GHz,8GB,128GB Flash Storage,Intel HD Graphics 6000,macOS,NaN,1.34kg,"898,94"
2,HP,250 G6,Notebook,"15.6""",Full HD 1920x1080,Intel Core i5 7200U 2.5GHz,8GB,256GB SSD,Intel HD Graphics 620,No OS,NaN,1.86kg,"575,00"
3,Apple,MacBook Pro,Ultrabook,"15.4""",IPS Panel Retina Display 2880x1800,Intel Core i7 2.7GHz,16GB,512GB SSD,AMD Radeon Pro 455,macOS,NaN,1.83kg,"2537,45"
4,Apple,MacBook Pro,Ultrabook,"13.3""",IPS Panel Retina Display 2560x1600,Intel Core i5 3.1GHz,8GB,256GB SSD,Intel Iris Plus Graphics 650,macOS,NaN,1.37kg,"1803,60"

In [191]:
laptops.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1303 entries, 0 to 1302
Data columns (total 13 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   Manufacturer              1303 non-null   object
 1   Model Name                1303 non-null   object
 2   Category                  1303 non-null   object
 3   Screen Size               1303 non-null   object
 4   Screen                    1303 non-null   object
 5   CPU                       1303 non-null   object
 6   RAM                       1303 non-null   object
 7    Storage                  1303 non-null   object
 8   GPU                       1303 non-null   object
 9   Operating System          1303 non-null   object
 10  Operating System Version  1133 non-null   object
 11  Weight                    1303 non-null   object
 12  Price (Euros)             1303 non-null   object
dtypes: object(13)
memory usage: 132.5+ KB

- change the column names

In [192]:
cols = []

for c in laptops.columns:
    c = c.strip()
    cols.append(c)

new_cols = []
for c in cols:
    c = c.replace("(" , "")
    c = c.replace(")" , "")
    c = c.lower()
    c = c.replace(" " , "_")
    new_cols.append(c)
    
laptops.columns = new_cols

In [193]:
laptops.columns

Index(['manufacturer', 'model_name', 'category', 'screen_size', 'screen',
       'cpu', 'ram', 'storage', 'gpu', 'operating_system',
       'operating_system_version', 'weight', 'price_euros'],
      dtype='object')

In [194]:
# we can directly assign the new names by our own 
# laptops.colums = ["manufacturer" , "model_name" , ............]

- next we need to know how to convert string columns to numeric data type
     1. explore the column
     2. remove unwanted values
     3. convert to numeric and rename if required

In [195]:
# start with the screen_size column in the array
laptops.iloc[:5, 2:5]

    category screen_size                              screen
0  Ultrabook       13.3"  IPS Panel Retina Display 2560x1600
1  Ultrabook       13.3"                            1440x900
2   Notebook       15.6"                   Full HD 1920x1080
3  Ultrabook       15.4"  IPS Panel Retina Display 2880x1800
4  Ultrabook       13.3"  IPS Panel Retina Display 2560x1600

- the screen size column needs to be cleaned first

In [196]:
laptops.screen_size.unique()

array(['13.3"', '15.6"', '15.4"', '14.0"', '12.0"', '11.6"', '17.3"',
       '10.1"', '13.5"', '12.5"', '13.0"', '18.4"', '13.9"', '12.3"',
       '17.0"', '15.0"', '14.1"', '11.3"'], dtype=object)

we can observe from the unique values in the column above that we need only to  remove the (") character  and then convert to numeric

In [197]:
# remove the bad characters
laptops["screen_size"] = laptops["screen_size"].str.replace('"' , "")

In [198]:
# convert the column to float datatype
laptops["screen_size"] = laptops["screen_size"].astype(float)

In [199]:
laptops.screen_size.dtype

dtype('float64')

In [200]:
# explore the ram column
laptops["ram"].unique()

array(['8GB', '16GB', '4GB', '2GB', '12GB', '6GB', '32GB', '24GB', '64GB'],
      dtype=object)

In [201]:
# remove the string from the column and convert ot to float data
laptops["ram"] = laptops["ram"].str.replace("GB" , "")
laptops["ram"] = laptops["ram"].astype(float)
laptops["ram"].unique()

array([ 8., 16.,  4.,  2., 12.,  6., 32., 24., 64.])

In [202]:
laptops["ram"] = laptops.ram.astype(int)
laptops.ram.unique()

array([ 8, 16,  4,  2, 12,  6, 32, 24, 64])

In [203]:
# rename the ram column good idea
laptops.rename(columns = {"ram" : "ram_gb"}  , inplace = True)

In [204]:
laptops.columns

Index(['manufacturer', 'model_name', 'category', 'screen_size', 'screen',
       'cpu', 'ram_gb', 'storage', 'gpu', 'operating_system',
       'operating_system_version', 'weight', 'price_euros'],
      dtype='object')

In [205]:
# extrac values from string 
laptops.gpu.head()

0    Intel Iris Plus Graphics 640
1          Intel HD Graphics 6000
2           Intel HD Graphics 620
3              AMD Radeon Pro 455
4    Intel Iris Plus Graphics 650
Name: gpu, dtype: object

In [206]:
manu = laptops["gpu"].str.split().str[0]
manu.unique()

array(['Intel', 'AMD', 'Nvidia', 'ARM'], dtype=object)

In [207]:
# extracting the second word from a string 
laptops["gpu"].str.split().str[2]

0           Plus
1       Graphics
2       Graphics
3            Pro
4           Plus
          ...
1298    Graphics
1299    Graphics
1300    Graphics
1301          R5
1302    Graphics
Name: gpu, Length: 1303, dtype: object

In [208]:
cpu_manu = laptops["cpu"].str.split().str[0]
cpu_manu.head()

0    Intel
1    Intel
2    Intel
3    Intel
4    Intel
Name: cpu, dtype: object

In [209]:
# how many intel laptops are there 
cpu_manu.isin(["Samsung"]).value_counts()

False    1302
True        1
Name: cpu, dtype: int64

In [210]:
(laptops.cpu.str.split().str[1] == "Celeron").value_counts()

False    1215
True       88
Name: cpu, dtype: int64

In [211]:
# see some incorrect values
laptops.operating_system.unique()

array(['macOS', 'No OS', 'Windows', 'Mac OS', 'Linux', 'Android',
       'Chrome OS'], dtype=object)

In [212]:
column = laptops.operating_system
column_2 = column.copy()

In [213]:
dct = {
    "macos" : "macos" , 
    "No os" : "Android",
    "Windows" : "Windows"
}

column.unique()

array(['macOS', 'No OS', 'Windows', 'Mac OS', 'Linux', 'Android',
       'Chrome OS'], dtype=object)

In [214]:
a = column.map(dic)

In [215]:
dct = {
    "macOS" : "macos" , 
    "No os" : "Android",
    "Windows" : "Windows",
    "Mac OS" : "macos",
    "Linux" : "Linux",
    "Android" : "Android",
    "Chrome OS" : "Chrome OS"
}

In [216]:
b = column.map(dct)

In [217]:
b.unique()

array(['macos', nan, 'Windows', 'Linux', 'Android', 'Chrome OS'],
      dtype=object)

In [218]:
dct = {
    "macOS" : "macos" , 
   
}

In [219]:
b = column.map(dct)

In [220]:
x = laptops.ram_gb

In [221]:
dct = {
    8 : 8,
    16:16,
    4:4,
    2:2,
    12:12,
    6:6,
    32:32,
    24:24,
    64:56
}

In [222]:
x = x.map(dct)

In [223]:
x.unique()

array([ 8, 16,  4,  2, 12,  6, 32, 24, 56], dtype=int64)

In [224]:
laptops.operating_system.value_counts()

Windows      1125
No OS          66
Linux          62
Chrome OS      27
macOS          13
Mac OS          8
Android         2
Name: operating_system, dtype: int64

In [225]:
dct = {
    "macOS" : "macos" , 
    "No os" : "Android",
    "Windows" : "Windows",
    "Mac OS" : "macos",
    "Linux" : "Linux",
    "Android" : "Android",
    "Chrome OS" : "Chrome OS"
}

In [226]:
laptops.operating_system = laptops.operating_system.map(dct)

In [227]:
laptops.operating_system.value_counts(dropna = False)

Windows      1125
NaN            66
Linux          62
Chrome OS      27
macos          21
Android         2
Name: operating_system, dtype: int64

In [228]:
gpu_company = laptops.gpu.str.split().str[0]
gpu_company.unique()

array(['Intel', 'AMD', 'Nvidia', 'ARM'], dtype=object)

In [229]:
gpu_company.value_counts(dropna = False)

Intel     722
Nvidia    400
AMD       180
ARM         1
Name: gpu, dtype: int64

In [230]:
laptops.manufacturer.unique()

array(['Apple', 'HP', 'Acer', 'Asus', 'Dell', 'Lenovo', 'Chuwi', 'MSI',
       'Microsoft', 'Toshiba', 'Huawei', 'Xiaomi', 'Vero', 'Razer',
       'Mediacom', 'Samsung', 'Google', 'Fujitsu', 'LG'], dtype=object)

In [231]:
# how many apple laptop in data 
(laptops.manufacturer == "Apple").value_counts()

False    1282
True       21
Name: manufacturer, dtype: int64

In [232]:
# how many MSI laptops in the dataset
(laptops.manufacturer == "MSI").value_counts()

False    1249
True       54
Name: manufacturer, dtype: int64

In [233]:
# using isin() method to get the same answer
laptops.manufacturer.isin(["Toshiba"]).value_counts()

False    1255
True       48
Name: manufacturer, dtype: int64

In [234]:
laptops.manufacturer.unique()

array(['Apple', 'HP', 'Acer', 'Asus', 'Dell', 'Lenovo', 'Chuwi', 'MSI',
       'Microsoft', 'Toshiba', 'Huawei', 'Xiaomi', 'Vero', 'Razer',
       'Mediacom', 'Samsung', 'Google', 'Fujitsu', 'LG'], dtype=object)

In [235]:
msi = laptops.loc[laptops.manufacturer == "MSI"]
msi.manufacturer.value_counts(dropna = False)

MSI    54
Name: manufacturer, dtype: int64

In [236]:
laptops.shape

(1303, 13)

In [237]:
laptops.dropna(axis = 0, how= "any" , inplace = True)
laptops.shape

(1133, 13)

In [238]:
laptops.iloc[0]

manufacturer                                   Acer
model_name                                 Aspire 3
category                                   Notebook
screen_size                                    15.6
screen                                     1366x768
cpu                         AMD A9-Series 9420 3GHz
ram_gb                                            4
storage                                   500GB HDD
gpu                                   AMD Radeon R5
operating_system                            Windows
operating_system_version                         10
weight                                        2.1kg
price_euros                                  400,00
Name: 5, dtype: object

### practise some pandas from the course

In [253]:
# missing data 
df = pd.DataFrame({"A" : [1,2,3,np.nan], 
                   "B" : [2,4,15,20], 
                  "C" : [10,11,13, np.nan],
                  "D" : [np.nan, 12,1,3], 
                  "F" : [np.nan, np.nan,15,10]})

df

     A   B     C     D     F
0  1.0   2  10.0   NaN   NaN
1  2.0   4  11.0  12.0   NaN
2  3.0  15  13.0   1.0  15.0
3  NaN  20   NaN   3.0  10.0

In [254]:
df.shape

(4, 5)

- for missing values in pandas we have df.dropna() method to drop rows or columns containing  ull values
- secondly we  have fillna( method to fill the missing values with specific value

In [255]:
df.dropna()

     A   B     C    D     F
2  3.0  15  13.0  1.0  15.0

In [256]:
df.dropna(axis= 1)

    B
0   2
1   4
2  15
3  20

In [257]:
df

     A   B     C     D     F
0  1.0   2  10.0   NaN   NaN
1  2.0   4  11.0  12.0   NaN
2  3.0  15  13.0   1.0  15.0
3  NaN  20   NaN   3.0  10.0

In [258]:
df.dropna(thresh = 1)

     A   B     C     D     F
0  1.0   2  10.0   NaN   NaN
1  2.0   4  11.0  12.0   NaN
2  3.0  15  13.0   1.0  15.0
3  NaN  20   NaN   3.0  10.0

In [259]:
df.dropna(thresh = 2)

     A   B     C     D     F
0  1.0   2  10.0   NaN   NaN
1  2.0   4  11.0  12.0   NaN
2  3.0  15  13.0   1.0  15.0
3  NaN  20   NaN   3.0  10.0

In [269]:
df.fillna(value = "Fill value")

            A   B           C           D           F
0         1.0   2        10.0  Fill value  Fill value
1         2.0   4        11.0        12.0  Fill value
2         3.0  15        13.0         1.0        15.0
3  Fill value  20  Fill value         3.0        10.0

- group by

In [270]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [273]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [280]:
(200+120+340+124+243+350) / 6

229.5

In [284]:
group = df.groupby("Company")

In [288]:
com_group = laptops.groupby("manufacturer")

In [289]:
com_group.mean()

              screen_size     ram_gb
manufacturer
Acer            15.198684   6.447368
Apple           12.700000   8.500000
Asus            15.468085   9.985816
Chuwi           14.500000   4.666667
Dell            15.086923   9.500000
Fujitsu         15.600000   6.666667
HP              14.957752   7.062016
Huawei          13.000000   8.000000
LG              15.066667  10.666667
Lenovo          14.773878   8.424490
MSI             16.442593  13.037037
Mediacom        13.457143   3.714286
Microsoft       13.500000   8.000000
Razer           14.514286  19.428571
Samsung         14.357143  12.571429
Toshiba         14.354167   8.666667
Vero            13.825000   3.500000
Xiaomi          13.300000   8.000000

In [291]:
# this shows the beauty of groupby() method in aggregating the data 
dct = {}

for comp in laptops.manufacturer.unique():
    selected_rows = laptops.loc[laptops.manufacturer == comp]
    mean = selected_rows["screen_size"].mean()
    dct[comp] = mean
    
dct

{'Acer': 15.198684210526318,
 'Apple': 12.7,
 'Asus': 15.468085106382947,
 'Dell': 15.086923076923055,
 'Lenovo': 14.77387755102039,
 'HP': 14.957751937984478,
 'Chuwi': 14.5,
 'MSI': 16.442592592592593,
 'Microsoft': 13.5,
 'Toshiba': 14.354166666666666,
 'Huawei': 13.0,
 'Vero': 13.825,
 'Razer': 14.514285714285714,
 'Mediacom': 13.457142857142857,
 'Fujitsu': 15.6,
 'Samsung': 14.357142857142858,
 'LG': 15.066666666666668,
 'Xiaomi': 13.3}

In [292]:
ram_agg = laptops.groupby(by = "ram_gb")

In [298]:
laptops.groupby("ram_gb").describe()

       screen_size
             count       mean       std   min   25%   50%     75%   max
ram_gb
2             19.0  13.368421  1.498537  11.6  11.6  14.0  14.000  15.6
4            290.0  14.876897  1.334471  10.1  14.0  15.6  15.600  17.3
6             41.0  15.714634  0.980194  12.3  15.6  15.6  15.600  17.3
8            547.0  14.825046  1.333540  11.3  13.5  15.6  15.600  17.3
12            24.0  15.729167  1.140358  13.3  15.6  15.6  16.025  17.3
16           191.0  15.559686  1.459631  12.5  14.0  15.6  17.300  17.3
24             3.0  15.633333  1.650253  14.0  14.8  15.6  16.450  17.3
32            17.0  16.929412  1.136202  13.3  17.3  17.3  17.300  18.4
64             1.0  17.300000       NaN  17.3  17.3  17.3  17.300  17.3

- we are using groupby() method in aggregation (mean, std, ....)

In [303]:
laptops.groupby("manufacturer").describe()

             screen_size                                                  \
                   count       mean       std   min     25%   50%    75%
manufacturer
Acer                76.0  15.198684  1.342187  11.6  14.000  15.6  15.60
Apple                8.0  12.700000  1.263781  11.6  12.000  12.0  13.30
Asus               141.0  15.468085  1.510739  11.6  14.000  15.6  17.30
Chuwi                3.0  14.500000  1.905256  12.3  13.950  15.6  15.60
Dell               260.0  15.086923  1.282968  11.6  14.000  15.6  15.60
Fujitsu              3.0  15.600000  0.000000  15.6  15.600  15.6  15.60
HP                 258.0  14.957752  1.440425  11.6  14.000  15.6  15.60
Huawei               2.0  13.000000  0.000000  13.0  13.000  13.0  13.00
LG                   3.0  15.066667  0.923760  14.0  14.800  15.6  15.60
Lenovo             245.0  14.773878  1.293098  10.1  14.000  15.6  15.60
MSI                 54.0  16.442593  0.996712  14.0  15.600  17.3  17.30
Mediacom             7.0  13.457143  0.882906  11.6  13.300  14.0  14.00
Microsoft            6.0  13.500000  0.000000  13.5  13.500  13.5  13.50
Razer                7.0  14.514286  2.017778  12.5  13.250  14.0  15.65
Samsung              7.0  14.357143  1.011364  13.3  13.300  15.0  15.00
Toshiba             48.0  14.354167  1.063907  12.5  13.300  14.0  15.60
Vero                 4.0  13.825000  0.350000  13.3  13.825  14.0  14.00
Xiaomi               1.0  13.300000       NaN  13.3  13.300  13.3  13.30

                   ram_gb
               max  count       mean       std  min   25%   50%   75%   max
manufacturer
Acer          17.3   76.0   6.447368  3.176559  4.0   4.0   4.0   8.0  16.0
Apple         15.4    8.0   8.500000  3.338092  4.0   8.0   8.0   8.0  16.0
Asus          17.3  141.0   9.985816  7.450777  2.0   4.0   8.0  16.0  64.0
Chuwi         15.6    3.0   4.666667  1.154701  4.0   4.0   4.0   5.0   6.0
Dell          17.3  260.0   9.500000  5.463462  2.0   8.0   8.0   8.0  32.0
Fujitsu       15.6    3.0   6.666667  2.309401  4.0   6.0   8.0   8.0   8.0
HP            17.3  258.0   7.062016  2.905119  2.0   4.0   8.0   8.0  16.0
Huawei        13.0    2.0   8.000000  0.000000  8.0   8.0   8.0   8.0   8.0
LG            15.6    3.0  10.666667  4.618802  8.0   8.0   8.0  12.0  16.0
Lenovo        17.3  245.0   8.424490  4.843389  2.0   4.0   8.0   8.0  32.0
MSI           18.4   54.0  13.037037  4.738294  8.0   8.0  16.0  16.0  32.0
Mediacom      14.0    7.0   3.714286  0.755929  2.0   4.0   4.0   4.0   4.0
Microsoft     13.5    6.0   8.000000  4.381780  4.0   5.0   8.0   8.0  16.0
Razer         17.3    7.0  19.428571  9.071147  8.0  16.0  16.0  24.0  32.0
Samsung       15.6    7.0  12.571429  4.276180  8.0   8.0  16.0  16.0  16.0
Toshiba       15.6   48.0   8.666667  5.240324  4.0   4.0   8.0   8.0  32.0
Vero          14.0    4.0   3.500000  1.000000  2.0   3.5   4.0   4.0   4.0
Xiaomi        13.3    1.0   8.000000       NaN  8.0   8.0   8.0   8.0   8.0

## Joining, merging and concatinatting